Тест_ЗУП_31_КОРП/src/InformationRegisters/ПланОбученияСотрудников/ПланОбученияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланОбученияСотрудников</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоУчебныхЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаНачалаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаОкончанияПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗаявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеРазвитие</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.МероприятияОбученияРазвития</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Documents/ПланОбученияРазвития/ПланОбученияРазвития.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланОбученияРазвития</name>
  <registerRecords>InformationRegister.ПланОбученияСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПланОбученияПоМероприятиям</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Мероприятия</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>CatalogRef.МероприятияОбученияРазвития</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчебныхЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСотрудников</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаВключениеВПланОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиМероприятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>НомерСтрокиМероприятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНаСотрудника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ПланОбученияСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьЦелевоеПодразделение(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПланОбученияРазвитияСотрудники.Ссылка КАК Регистратор,
		|	ПланОбученияРазвитияСотрудники.Ссылка.Подразделение КАК Подразделение,
		|	ПланОбученияРазвитияМероприятия.Мероприятие КАК Мероприятие,
		|	ПланОбученияРазвитияМероприятия.ДатаНачала КАК ДатаНачала,
		|	ПланОбученияРазвитияМероприятия.ДатаОкончания КАК ДатаОкончания,
		|	ПланОбученияРазвитияСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПланОбученияРазвитияМероприятия.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
		|	ПланОбученияРазвитияСотрудники.СуммаНаСотрудника КАК СуммаРасходов,
		|	ПланОбученияРазвитияМероприятия.Подразделение КАК ЦелевоеПодразделение,
		|	ПланОбученияРазвитияСотрудники.Сотрудник КАК Сотрудник,
		|	ПланОбученияРазвитияСотрудники.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.ПланОбученияРазвития.Сотрудники КАК ПланОбученияРазвитияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланОбученияРазвития.Мероприятия КАК ПланОбученияРазвитияМероприятия
		|		ПО ПланОбученияРазвитияСотрудники.Ссылка = ПланОбученияРазвитияМероприятия.Ссылка
		|			И ПланОбученияРазвитияСотрудники.НомерСтрокиМероприятия = ПланОбученияРазвитияМероприятия.НомерСтрокиМероприятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументы.Регистратор КАК Регистратор,
		|	ВТДокументы.Подразделение КАК Подразделение,
		|	ВТДокументы.Мероприятие КАК Мероприятие,
		|	ВТДокументы.ДатаНачала КАК ДатаНачала,
		|	ВТДокументы.ДатаОкончания КАК ДатаОкончания,
		|	ВТДокументы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТДокументы.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
		|	ВТДокументы.СуммаРасходов КАК СуммаРасходов,
		|	ВТДокументы.ЦелевоеПодразделение КАК ЦелевоеПодразделение,
		|	ВТДокументы.Сотрудник КАК Сотрудник,
		|	ВТДокументы.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТДокументы КАК ВТДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланОбученияСотрудников КАК ПланОбученияСотрудников
		|		ПО ВТДокументы.Регистратор = ПланОбученияСотрудников.Регистратор
		|			И ВТДокументы.НомерСтроки = ПланОбученияСотрудников.НомерСтроки
		|			И ВТДокументы.ЦелевоеПодразделение <> ПланОбученияСотрудников.ЦелевоеПодразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТДокументы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		НаборЗаписей = РегистрыСведений.ПланОбученияСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Выборка.Количество() = 0);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
